Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/criminal_law/criminal_offences/public_order_offenses_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: The offence of riot can be utilised by the Gardai in situations where large groups assemble in protest and the protest turns into unlawful violence
ga: Is féidir leis na Gardaí an cion ar círéib é a úsáid i staideanna ina bhfuil grúpaí móra cruinnithe le haghaidh agóide agus nuair a thiontaíonn an agóid ina fhoréigean mídhleathach

source: The maximum penalty for the offence of riot is an unlimited fine and/or a period of imprisonment for up to 10 years
ga: Is í an uas-phianbhreith as an gcion ar círéib é ná fíneáil gan teorainn agus/nó tréimhse príosúnachta suas le 10 mbliana

source: Violent disorder, which is covered by Section 15 of the Act, is similar to the offence of riot although it is a lesser version of that offence
ga: Tá mí-ord foréigneach, a chlúdaítear le Alt 15 den Acht, cosúil leis an gcion ar círéib é ach is leagan níos lú den chion sin é

source: Violent disorder reduces the number of persons present to a minimum of 3
ga: Laghdaíonn mí-ord foréigneach líon na ndaoine i laghdú go 3

source: These persons present must use or threaten to use violence and the conduct of those persons, taken together is such as would cause a person of reasonable firmness, if present at that place to fear for his or her safety or the safety of another person
ga: Caithfidh na daoine seo atá i láthair foréigean a úsáid nó a bhagairt agus caithfidh iompar na ndaoine sin, á ghlacadh ina iomláine, de chineál a bheadh ina chúis le heagla a chur ar dhuine de dhiongbháilteacht réasúnta, a bheadh i láthair san áit sin, maidir lena shábháilteacht féin nó le sábháilteacht duine eile

source: For an offence of riot to take place the accused person must have used violence whereas in the case of violent disorder the accused person need only threaten to use violence
ga: Caithfidh gur úsáid an duine cúisithe foréigean i gcás an chiona ar círéib é, ach i gcás an mhí-oird fhoréignigh, ní gá dóibh ach bagairt foréigean a úsáid

source: It is also of note that riot and violent disorder differ in that there is no requirement for the group to share a common design or purpose
ga: Ba chóir a nótáil chomh maith go bhfuil de dhifear idir círéib agus mí-ord foréigneach chomh maith nach gá don ghrúpa comhrún nó comhchuspóir a bheith acu

source: The maximum penalty for violent disorder is an unlimited fine and or a period of imprisonment for up to 10 years
ga: Is í an uas-phianbhreith as mí-ord foréigneach ná fíneáil gan teorainn agus nó tréimhse príosúnachta suas le 10 mbliana

source: Section 16 of the Criminal Justice (Public Order) Act 1994 states-
ga: Deir Alt 16 den Acht um Cheartas Coiriúil (Ord Poiblí) 1994 -

source: • Two or more persons at any place (public or private) use or threaten to use violence towards each other, and
ga: • go n-úsáidfidh beirt nó níos mó daoine in áit ar bith (cibé acu is áit phoiblí nó áit phríobháideach nó iad araon an áit sin) foréigean nó má bhagraíonn siad foréigean a úsáid ar a chéile, agus

source: • The violence so used or threatened by one of those persons is unlawful, and
ga: • go bhfuil an foréigean a úsáidtear mar sin nó a bhagraíonn duine de na daoine sin a úsáid mídhleathach

source: • The conduct of those persons, taken together, is such as would cause a person of reasonable firmness present at that place to fear for his or her safety or the safety of another,
ga: • go bhfuil iompar na ndaoine sin, á ghlacadh ina iomláine, de chineál go mbeadh eagla ar dhuine de dhiongbháilteacht réasúnta a bheadh i láthair ag an áit sin maidir lena shábháilteacht féin nó ar le sábháilteacht duine eile

source: then, each such person who uses or threatens to use unlawful violence shall be guilty of the offence of affray”
ga: Ansin beidh gach duine de na daoine a úsáidfidh nó a bhagróidh foréigean neamhdhleathach ciontach sa chion ar gráscar é.”

source: The most important difference between affray and the offences of riot and violent disorder is that the violence involved in affray must be directed towards each other and not innocent by-standards
ga: Is é an difear is tábhachtaí idir gráscar agus na cionta ar círéib agus mí-ord foréigneach iad ná go gcaithfear an foréigean sa ghráscar a bheith dírithe ar a chéile agus ní ar bhaill neamhchiontacha den phobal

source: An example of this would simply be a group of persons fighting against each other in the street
ga: Mar shampla, dá mbeadh grúpa daoine ag troid lena chéile sa tsráid, gráscar a bheadh ann

source: However, as in the previous two offences the affray can take place in public or private
ga: Ach, cosúil leis an dá chion roimhe seo, is féidir leis an ngráscar tarlú in áit phoiblí nó in áit phríobháideach

source: The offence of affray is only committed where there is actual unlawful violence used
ga: Ní dhéantar an cion ar gráscar é ach nuair a úsáidtear foréigean neamhdhleathach

source: Threats alone will not constitute the offence of affray
ga: Ní gráscar é mura bhfuil ann ach bagairtí

source: A person convicted of affray may receive a maximum penalty of an unlimited fine and or a term of imprisonment for up to five years
ga: Is féidir uas-phianbhreith d'fhíneáil neamhtheoranta agus téarma príosúnachta suas le cúig bliana a ghearradh ar dhuine a chiontaítear as gráscar

source: Blackmail, extortion and demanding money with menaces
ga: Dúmhál, sracadh agus airgead a éileamh go bagrach

source: Section 17 of the Criminal Justice (Public Order) Act 1994 creates a new version of the blackmail and extortion offences which were previously contained in the Larceny Act, 1916 which have now been repealed
ga: Cruthaíonn Alt 17 den Acht um Cheartas Coiriúil (Ord Poiblí) 1994 leagan nua de na cionta dúmháil agus sractha a bhí ann roimhe seo sa Larceny Act, 1916, atá aisghairmthe anois

source: If a person makes an unwarranted demand with menaces for the purpose of making a gain for themselves or another or with the intention to cause a loss to another they will be guilty of this offence
ga: Má dhéanann duine éileamh gan údar d'fhonn gnóthachán a dhéanamh dóibh féin nó do dhuine eile a bhfuil sé ar a n-intinn é a bheith ina chúis le caillteanas do dhuine eile, beidh siad ciontach sa chion seo

source: The exception to this offence is that if the person making the demand with menaces believes that:-
ga: Bíonn eisceacht ann don chion seo má chreideann an duine atá ag déanamh an éilimh le bagairtí:

source: • He has reasonable grounds for making the demand, and
ga: • Go bhfuil forais réasúnacha aige leis an éileamh a dhéanamh, agus

source: • The use of menaces is a proper means of reinforcing the demand
ga: • Gur modh cuí chun an t-éileamh a athneartú é bagairtí a dhéanamh

source: While there is no definition in the Act of “menaces” the meaning of the word was defined in case-law under the Old Larceny Act, 1916
ga: Cé nach bhfuil aon sainmhíniú san Acht ar “Bhagairtí” rinneadh sainmhíniú ar an bhfocal i ndlí na gcás faoin Old Larceny Act, 1916

source: In a case called Thorne–v-Motor Trade Association (1937) the court stated that:-
ga: I gcás darbh ainm Thorne-v-Motor Trade Association (1937) dúirt an chúirt:-

source: “the word menace is to be liberally construed, and not as limited to threats of violence but as to include threats of any action detrimental to or unpleasant to the person addressed”
ga: “tá an focal bagairt le construáil go saor, agus ní mar a bheadh sé teoranta do bhagairtí foréigin ach leis an bhfocal bagairtí ag cuimsiú aon ghníomh a dhéanamh a bheadh díobhálach nó míthaitneamhach don duine a bhfuil sé dírithe air.”

source: Therefore the definition of menace would include threats to post on the internet details of a persons sexual life or threats to publish explicit photographs of a person
ga: Dá bhrí sin, chuimseodh bagairt bagairtí sonraí saoil ghnéis duine a chur ar an idirlíon nó bagairtí grianghraif fhollasacha de dhuine a fhoilsiú

source: Neither of these actions could be said to be a proper way of enforcing what would otherwise be a legitimate demand for the payment of a debt
ga: Níorbh fhéidir a rá gur mhodh ceart ceachtar den dá ghníomh seo le héileamh dlisteanach ar dhuine fiacha a íoc a chur i bhfeidhm

source: If a person is convicted of this offence the maximum punishment is an unlimited fine and or a term of imprisonment of up to 14 years
ga: Má chiontaítear duine as an gcion seo is é an t-uasphionós ná fíneáil neamhtheoranta agus nó téarma príosúnachta suas le 14 bliana

source: Assault with intent to cause bodily harm or commit an indictable offence
ga: Ionsaí le hintinn díobháil choirp nó cion indíotáilte a dhéanamh

source: While the main area of law that deals with assault is the Non-fatal Offences against the Person Act, 1997, Section 18 of the Criminal Justice (Public Order) Act 1994 creates a further offence of assault with intent to cause bodily harm or to commit an indictable offence
ga: Cé gurb í an tAcht um Chionta Neamh-mharfacha in aghaidh an Duine, 1997, an phríomhchuid den dlí a bhaineann le hionsaí, cruthaíonn Alt 18 den Acht um Cheartas Coiriúil (Ord Poiblí) 1994 cion breise arb é ionsaí le hintinn díobháil choirp nó cion indíotáilte a dhéanamh

source: This is an aggravated assault and states-
ga: Is tromionsaí é seo agus deir sé:

source: “Any person who assaults another person with intent to cause bodily harm or to commit an indictable offence shall be guilty of an offence”
ga: “Aon duine a ionsóidh duine eile le hintinn díobháil choirp nó cion indíotailte a dhéanamh, beidh sé ciontach i gcion.”

source: A person convicted of this offence could face a maximum penalty of an unlimited fine and or term of imprisonment for up to 5 years
ga: Aon duine a chiontaítear as an gcion seo, dlífear uas-phianbhreith d'fhíneáil neamhtheoranta nó téarma príosúnachta suas le 5 bliana, nó an dá rud, a chur air

source: Assault or obstruction of a peace officer
ga: Ionsaí nó toirmeasc ar oifigeach síochána

source: Section 19 of the Criminal Justice (Public Order) Act 1994 defines a “Peace Officer” as a member of the Garda Siochana, a Prison Officer or a member of the Defence Forces
ga: Sainmhíníonn Alt 19 den Acht um Cheartas Coiriúil (Ord Poiblí) 1994 Oifigeach Síochána mar bhall den Gharda Síochána, Oifigeach Príosúin nó ball de na fórsaí cosanta

source: Section 185 of the Criminal Justice Act 2006 has extended this definition to ambulance personnel and fire brigade personnel
ga: Chuir Alt 185 den Acht um Cheartas Coiriúil 2006 leathnú ar an sainmhíniú seo le foireann otharchairr agus pearsanra na briogáide dóiteáin a chuimsiú

source: The offence replaces the old offence of assaulting or obstructing a peace officer which was contained in section 38 of the Offences against the Person Act, 1861
ga: Tagann an cion seo in áit an tseanchiona arbh oifigeach síochána a ionsaí nó a thoirmeasc é a bhí in alt 38 den Acht um Chionta in aghaidh an duine, 1861

source: The important elements of this offence are as follows:
ga: Is iad seo a leanas na heilimintí is tábhachtaí den chion seo:

source: • That the assault was on a peace officer acting in the execution of their duty, or
ga: • Go raibh an t-ionsaí ar oifigeach síochána agus iad ag comhlíonadh a ndualgas, nó

source: • That the assault was on any other person who was aiding or assisting the peace officer, or
ga: • Go raibh an t-ionsaí ar aon duine eile a bhí ag cuidiú nó ag cúnamh leis an oifigeach síochána, nó

source: • That the assault on any other person was to prevent the lawful arrest or detention of himself or of any other person for any offence
ga: • Go raibh an t-ionsaí ar aon duine eile chun gabháil dhlíthiúil nó coinneáil an duine nó aon duine eile as aon chion a thoirmeasc

source: Similarly, a person will be guilty of the offence if they wilfully obstruct a peace officer acting in the course of their duty or obstructs any person who is assisting or helping the peace office in the course of their duty
ga: Ar an dóigh chéanna, beidh duine ciontach i gcion má thoirmisceann siad oifigeach síochána go toiliúil agus iad i mbun a ndualgais nó má thoirmisceann siad aon duine atá ag cúnamh nó ag cuidiú leis an oifigeach síochána i mbun a dhualgais

source: The most interesting aspect to the punishment for assault is that the accused person is given a choice as to whether or not to have their case dealt with in the District Court or to have the case dealt with in the Circuit Criminal Court before a jury
ga: Is é an ghné is spéisiúla faoin phionós as ionsaí a dhéanamh ná go dtugtar rogha don duine cúisithe an bhfuil siad ag iarraidh go ndéileálfaí lena gcás sa Chúirt Dúiche nó go ndéileálfaí leis sa Chúirt Choiriúil Chuarda os comhair giúiré

source: If someone is convicted in the District Court the maximum penalty is a class A fine and/or a term of imprisonment not exceeding 12 months
ga: Má chiontaítear duine sa Chúirt Dúiche is í an phianbhreith is mó ná rang A fíneáil agus/nó téarma príosúnachta nach mó ná 7 mbliana

source: In relation to obstruction, the maximum penalty is a class C fine and/or a term of imprisonment of 6 months
ga: Maidir le toirmeasc, is í an phianbhreith is mó ná rang C fíneáil agus/nó téarma príosúnachta de 6 mhí

source: Attacks on emergency service personnel
ga: Ionsaithe ar phearsanra seirbhíse géarchéime

source: The Criminal Justice Act 2006 has, as mentioned above, amended Section 19 of the Criminal Justice (Public Order) Act 1994 to include people providing emergency services
ga: Mar a dúradh thuas, tá leasú déanta ar an Acht um Cheartas Coiriúil 2006 le hAlt 19 den Acht um Cheartas Coiriúil (Ord Poiblí) 1994, le daoine a chuireann seirbhísí géarchéime ar fáil a chuimsiú

source: The Act creates new offences of assaulting or obstructing emergency service personnel, such as fire brigade personnel and ambulance crews, engaged in providing emergency services
ga: Cruthaíonn an tAcht cionta nua ar ionsaí nó toirmeasc a dhéanamh ar phearsanra na seirbhísí géarchéime iad, leithéidí pearsanra na briogáide dóiteáin agus foirne otharcharr, a bhíonn ag soláthar seirbhísí géarchéime

source: It also covers those working in accident and emergency departments of hospitals
ga: Is féidir tuilleadh eolais ar sheirbhísí éigeandála sláinte a fháil anseo
